// pages/tourismdetail/tourismdetail.js
const tourismlist = [{
  id: 1,
  name: "南岳衡山",
  address: "南岳",
  info:[ "衡山是中国著名的道教、佛教圣地，环山有寺、庙、庵、观200多处。衡山是上古时期君王唐尧、虞舜巡疆狩猎祭祀社稷，夏禹杀马祭天地求治洪方法之地。衡山山神是民间崇拜的火神祝融，他被黄帝委任镇守衡山，教民用火，化育万物，死后葬于衡山赤帝峰，被当地尊称南岳圣帝。道教“三十六洞天，七十二福地”，有四处位于衡山之中，佛祖释迦牟尼两颗真身舍利子藏于衡山南台寺金刚舍利塔中。","衡山是由沧海变为高山的，衡山的古地形与整个湖南省的地形发育是分不开的。从志留纪、奥陶纪起一直到侏罗纪末，湖南的东部为古华夏大陆，西部和北部为古江南大陆，中部和南部为一大海湾。海水为喜马拉雅山大内斜经广西侵入湖南，最北可达长沙。湾内的海水，时进时退，时深时浅，衡山正处于海水进退的大道上。","衡山最好观星和观日出，景色极为震撼，夏末秋初8至10月份是衡山观星的最好时间，在祝融峰顶观赏最佳。衡山看日出的黄金时期是每年的7-9月份，在山顶的望日台，可以看到日出时最盛的风景"],
  imgArr: ["https://picx.zhimg.com/80/v2-ca8107c06cf04a5cd5295bb18d138d63_1440w.webp?source=1def8aca","https://picx.zhimg.com/80/v2-1549adc64cb6733d4510b475242f647b_1440w.webp?source=1def8aca","https://pic1.zhimg.com/80/v2-e7e58905b765ab36f9961d225d97b6bb_1440w.webp?source=1def8aca"]
}, {
  id: 2,
  name: "石鼓书院",
  address: "衡阳",
  info: ["石鼓书院位于衡阳市石鼓区石鼓山，湘江、蒸水、耒水三江环绕，书院内亭台楼榭，绿荫重重，自古有“石鼓江山锦绣华”的美誉。石鼓书院是有确切史志记载的中国创建最早的书院，承载着厚重的历史文化底蕴，是湖湘文化发源地和湖南第一胜地。自古以来众多文人骚客慕名前来，在此留下诗句。","石鼓书院主要由武侯祠、李忠节公祠、大观楼、七贤祠、敬业堂、合江亭等建筑构成，总占地面积约4000平方米，是中国古代最早的一所由私人创建的书院。现为衡阳市传统文化教育基地，定期组织举行研学、表演、祭祀等活动。","石鼓书院有石鼓山唐代至清代摩崖石刻近30处，主要集中在石鼓山西面约40米长的山岩上，与清乾隆年间《清泉县志》所载'历代摩崖在西奚谷石壁'无异。《清泉县志》载：'西奚谷二字在西奚谷石壁，字大径八寸，与东岩字皆贞观中刺史宇文炫书。考证发现西奚谷二字保存完好，其右侧约1米处有一处摩崖，内容为'予守衡一载，时事多蹇。闻石鼓之有西奚谷，无暇履其地而览胜为恨。因与馈遗之列，休官后复来衡。栖迟书院，从荒藤蔓草中觅出西奚谷 ，乃了前缘也。为之修槛奠石，偕友啸咏其间一月而归。姑苏之安亭张时立石；康熙元年春三月朔日'。石刻中保存较好的还有'江上清风''蒸湘''介崖''高山流水'及一些记事刻石。"],
  imgArr: ['https://picx.zhimg.com/80/v2-7bb11ada329cc356ebd46e2e42a5d85c_1440w.webp?source=1def8aca']
},
{
  id: 3,
  name: "罗荣桓故居",
  address: "衡阳",
  info: ["罗荣桓故居位于中南重镇、历史文化名城——湖南省衡阳市衡东县荣桓镇南湾村，为国家4A级旅游景区、全国重点文物保护单位、全国100个红色旅游经典景区、全国爱国主义教育示范基地、国家国防教育示范基地、第四届中国红色旅游市场游客满意十佳景区。"],
  imgArr: ['https://picx.zhimg.com/80/v2-e791349d1c36394a2ac026ae564b6672_1440w.webp?source=1def8aca','https://bkimg.cdn.bcebos.com/pic/b3fb43166d224f4a8ed0c2760ef790529822d10e?x-bce-process=image/format,f_auto/quality,Q_70/resize,m_lfit,limit_1,w_536']
},
{
  id: 4,
  name: "蔡伦竹海",
  address: "耒阳",
  info: ["蔡伦竹海位于中南重镇、历史文化名城——耒阳市黄市镇和大义乡境内，面积100平方公里，中心景区达66平方公里，集观光、休闲、探险、寻宝于一体的复合型旅游风景区，现为国家AAAA级旅游景区、中国最具魅力生态旅游景点景区、国家级水利风景区、省级风景名胜区、省级森林公园和省级山地车训练基地。","蔡伦竹海游客中心，徐霞客游记默然表白，蔡伦雕塑庄严耸立，郦道元《水经注》卷轴舒展，历史的厚重感顿时让人肃然起敬。公元75年，蔡伦从竹林走出。敦厚尽心、暴体田野，终于于公元105年发明了造纸术。功成而不忘桑梓，在这遍竹海广寻造纸原料，深入民间传授造纸技艺。竹海深处，至今仍保留有百余家古法造纸作坊，成为一道承载千年历史的风景线。千百年来，唐代诗人韩愈拜谒张良洞、徐霞客探幽揽胜登直钓岩、曾国藩筹粮募饷赠牌匾。","观景楼位于竹海最高峰鼎峰坳，海拔541米，占地面积700平方米，为五层高古典式塔楼，楼高36m，主要供游客登高览竹，设有游步道、凉亭和观景台。站在观景楼上，顿时心旷神怡，向南观竹，渺渺茫茫，一泻千里；向北观竹，耒水像一条白练在风波浪尖间飞舞。大河滩、黄泥岗也似正在竹海中航行的客轮。天空抹了几朵淡淡白云，层峦叠嶂之上披了一层薄雾，在大气磅礴之中频添了几分秀色和神秘。"],
  imgArr: ['https://pic1.zhimg.com/80/v2-b7fc31f83976dd60c426e95d0eb8b77a_1440w.webp?source=1def8aca','https://ts1.cn.mm.bing.net/th/id/R-C.9c786f68e62396c706758299ead3bfad?rik=jcjvQZp%2fyn6AMg&riu=http%3a%2f%2fyouimg1.c-ctrip.com%2ftarget%2f100c070000002fnvw0C15.jpg&ehk=MX%2fjCCONrDUsxL0Bl3Cd%2fLgdd42clYh97NB5cASdotg%3d&risl=&pid=ImgRaw&r=0']
},
{
  id: 5,
  name: "衡阳花果山",
  address: "衡阳",
  info: ["全方位展现了西游文化的精髓与奇趣，也被称为“南岳衡山的后花园。这里林业资源极为丰富，有着四洞通天的奇特丹霞地貌。还会看到按西游记一比一复制的金箍棒，西游经典场景的复刻在这里都可以见到。","据《西游记》记载，群猴嬉戏，偶尔发现一股飞瀑流泉。“一派白虹起，千寻雪浪飞”。唯有石猴胆大，暝目蹲身，将身一纵，跃入瀑布发现水帘洞，被众猴推选为美猴王，猴群从此在水帘洞内安家立命，朝游花果山，夜宿水帘洞，不胜欢乐"],
  imgArr: ['https://youimg1.c-ctrip.com/target/100g0w000000kpnhhB6D9.jpg','https://baike.baidu.com/pic/%E8%8A%B1%E6%9E%9C%E5%B1%B1/20122833/0/34fae6cd7b899e5159858cf04ea7d933c9950dce?fr=lemma&fromModule=lemma_content-image']
},
{
  id: 6,
  name: "中国印山",
  address: "常宁",
  info: [`“中国印山”为全国创建，印山包括“一山三城”，即中国名人名章城、中国书法城、中国纪念印章城，把几千年来的中国玺印图案摩岩于山石上，使人文景观与自然景观融为一体，汇集了5700多枚形态各异的印章图案`,`中国印山由中国书法城、中国名人名章城、中国纪念印章城组成“一山三城”。它以摩岩的形式，把我国数千年的书法、印章精品篆刻于一山，共计印章4300枚，书法石刻作品700余件，规模达1500余亩，堪称“中华一绝”。篆刻欣赏是一种综合美的艺术享受。中国印山推出的印章有2000多枚，其中亚禽氏、瞿甲、子亘是迄今发现的最早的殷商三印`,`如今，像尹伯刚这样的农民版画作者，常宁市不下300人，常宁版画群体先后创作版画作品2100余件，获省美展和全国性美展奖的有110多件。常宁版画以“浓郁的乡土气息”享誉省内外，吴国威不知为此倾注了多少心血。
  2000年的一天，吴国威突然萌生奇想：全国还没有人把印章艺术以摩崖石刻的形式大规模地在大自然中表现，如果把中国几千年的篆刻精品刻於山水之间，在美景中展现艺术，让印章与奇石交融，促进文化、旅游共同发展，岂不两全齐美？`],
  imgArr: ['https://ts1.cn.mm.bing.net/th/id/R-C.b56ed403433e565e99ba101ba17b5aeb?rik=A9u0cydtLHZQjg&riu=http%3a%2f%2fpic1.k1u.com%2fk1u%2fmb%2fd%2ffile%2f20220520%2f1653016692342953_836_10000.jpg&ehk=8nG77SDMYl8M1oG%2bPzMtFvJBI0z7uAhtK8hHFhho77I%3d&risl=&pid=ImgRaw&r=0','https://ts1.cn.mm.bing.net/th/id/R-C.3ad30c8f27177db8a76eb2a48ca61f05?rik=ISU19qwILOv4JQ&riu=http%3a%2f%2fimg.tcmap.com.cn%2f118%2f1186%2fw660279880.jpg&ehk=TksHoIwbXLYwjxAU8f4W152foMdLpv9nwpJDAYZCtfw%3d&risl=&pid=ImgRaw&r=0']
},
]
var markersData = [];
Page({
  data: {
    tourismDetailData:{}
  },
  gototourismdetail(){
    wx.navigateTo({
      url: '../tourism/tourism',
    })
  },
  onLoad(options) {
    const {id} = options
    const data = tourismlist.filter(x => x.id == id)
    console.log(data[0].imgArr.length);
    this.setData({
      tourismDetailData: data[0]
    })
  },

})